// src/locales/zh-TW/Common.ts
const commonZhTW = {
  drawer: {
    N5: [
      'あ', 'い', 'う', 'え', 'お',
      'か', 'き', 'く', 'け', 'こ',
      'さ', 'し', 'す', 'せ', 'そ',
      'た', 'ち', 'つ', 'て', 'と',
      'な', 'に', 'ぬ', 'ね', 'の',
      'は', 'ひ', 'ふ', 'へ', 'ほ',
      'ま', 'み', 'む', 'め', 'も',
      'や', 'ゆ', 'よ', 
      'ら', 'り', 'る', 'れ', 'ろ',
      'わ'  
    ],
    "N4-N3": [
      'あ', 'い', 'う', 'え', 'お',
      'か', 'き', 'く', 'け', 'こ',
      'さ', 'し', 'す', 'せ', 'そ',
      'た', 'ち', 'つ', 'て', 'と',
      'な', 'に', 'ぬ', 'ね', 'の',
      'は', 'ひ', 'ふ', 'へ', 'ほ',
      'ま', 'み', 'む', 'め', 'も',
      'や', 'ゆ', 'よ', 
      'ら', 'り', 'る', 'れ', 'ろ',
      'わ'  
    ],
    "N5-KANJI": ["數字", "時間", "方位", "人", "自然", "事物"],
  },
  levels: {
    N5: "N5單字",
    "N5-KANJI": "N5漢字",
    "N4-N3": "N4-N3單字",
  },
  update: {
    title: "需要新版本",
    message: "發現新版本，請前往 App Store 下載最新版本。",
    cancel: "取消",
    goToStore: "前往 App Store",
  },
};

export default commonZhTW;