// src/locales/zh-CN/Common.ts
const commonZhCN = {
    drawer: {
      N5: [
        'あ', 'い', 'う', 'え', 'お',
        'か', 'き', 'く', 'け', 'こ',
        'さ', 'し', 'す', 'せ', 'そ',
        'た', 'ち', 'つ', 'て', 'と',
        'な', 'に', 'ぬ', 'ね', 'の',
        'は', 'ひ', 'ふ', 'へ', 'ほ',
        'ま', 'み', 'む', 'め', 'も',
        'や', 'ゆ', 'よ', 
        'ら', 'り', 'る', 'れ', 'ろ',
        'わ'  
      ],
      "N4-N3": [
        'あ', 'い', 'う', 'え', 'お',
        'か', 'き', 'く', 'け', 'こ',
        'さ', 'し', 'す', 'せ', 'そ',
        'た', 'ち', 'つ', 'て', 'と',
        'な', 'に', 'ぬ', 'ね', 'の',
        'は', 'ひ', 'ふ', 'へ', 'ほ',
        'ま', 'み', 'む', 'め', 'も',
        'や', 'ゆ', 'よ', 
        'ら', 'り', 'る', 'れ', 'ろ',
        'わ'  
      ],
      "N5-KANJI": ["数字", "时间", "方位", "人", "自然", "事物"],
    },
    levels: {
      N5: "N5单字",
      "N5-KANJI": "N5汉字",
      "N4-N3": "N4-N3单字",
    },
    update: {
      title: "需要新版本",
      message: "发现新版本，请前往 App Store 下载最新版本。",
      cancel: "取消",
      goToStore: "前往 App Store",
    },
  };
  
  export default commonZhCN;